linux/pgformatter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pgFormatter</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">pgFormatter</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9dcd0b">1. 概述</a></li>
<li><a href="#org053a906">2. 安装</a></li>
<li><a href="#orgd3f437e">3. 配置</a></li>
<li><a href="#org5209b4c">4. 使用</a>
<ul>
<li><a href="#orgff22c35">4.1. 终端/控制台执行</a></li>
<li><a href="#org2c2275e">4.2. CGI context</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9dcd0b" class="outline-2">
<h2 id="orgd9dcd0b"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/darold/pgFormatter">pgFormatter</a> 是 PostgreSQL 和 SQL 的代码格式化工具。可以识别 SQL-92、SQL-99、SQL-2003，SQL-2008，SQL-2011 和 PostgreSQL 中特定的关键字，也适用于任何其他数据库。
</p>

<p>
pgFormatter 可以作为控制台程序或 CGI 使用。它会自动检测所处环境并根据上下文输出为文本或 HTML。
</p>

<p>
高亮关键字显示仅在 CGI 上下文中可用。
</p>
</div>
</div>

<div id="outline-container-org053a906" class="outline-2">
<h2 id="org053a906"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">git clone git@github.com:darold/pgFormatter.git
<span style="color: #d18aff;">cd</span> pgFormatter/
perl Makefile.PL
make &amp;&amp; sudo make install
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3f437e" class="outline-2">
<h2 id="orgd3f437e"><span class="section-number-2">3</span> 配置</h2>
</div>

<div id="outline-container-org5209b4c" class="outline-2">
<h2 id="org5209b4c"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgff22c35" class="outline-3">
<h3 id="orgff22c35"><span class="section-number-3">4.1</span> 终端/控制台执行</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
pg_format [options] file.sql
</pre>

<p>
Options:
</p>
<ul class="org-ul">
<li>-a | &#x2013;anonymize : 隐藏查询中的所有文字，有助于在格式化之前隐藏机密数据。</li>
<li>-b | &#x2013;comma-start    : 在参数列表中，以逗号开头（参见 -e）。</li>
<li>-B | &#x2013;comma-break    : 在 insert 语句中，在每个逗号后添加换行符。</li>
<li>-d | &#x2013;debug：启用调试模式。默认情况下禁用。</li>
<li>-e | &#x2013;comma-end：在参数列表中，以逗号结尾（默认）</li>
<li>-f | &#x2013;function-case N：更改保留关键字的大小写。默认值保持不变：0。值：0 =&gt; 未更改，1 =&gt; 小写，2 =&gt; 大写，3 =&gt; 大写。</li>
<li>-F | &#x2013;format STR：输出格式：text 或 html。默认值：text。</li>
<li>-h | &#x2013;help：显示此消息并退出。</li>
<li>-m | &#x2013;maxlength SIZE：查询的最大长度，超过给定大小将被切割。默认值：无截断。</li>
<li>-n | &#x2013;nocomment：从 SQL 代码中删除任何注释。</li>
<li>-o | &#x2013;output file：定义输出的文件名。默认值：stdout。</li>
<li>-p | &#x2013;placeholder re：设置正则表达式以查找不得更改的代码。</li>
<li>-s | &#x2013;spaces size：更改空格缩进，默认为 4 个空格。</li>
<li>-S | &#x2013;separator STR：动态代码分隔符，默认为单引号。</li>
<li>-t | &#x2013;format-type：为某些语句尝试另一种格式化类型。</li>
<li>-u | &#x2013;keyword-case N：更改保留关键字的大小写。默认值为大写：2。值：0 =&gt; 未更改，1 =&gt; 小写，2 =&gt; 大写，3 =&gt; 大写。</li>
<li>-v | &#x2013;version：显示 pg_format 版本并退出。</li>
</ul>

<p>
示例：
</p>
<div class="org-src-container">
<pre class="src src-sh">cat samples/ex1.sql | pg_format -
pg_format -n samples/ex1.sql
pg_format -f 2 -n -o result.sql samples/ex1.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c2275e" class="outline-3">
<h3 id="org2c2275e"><span class="section-number-3">4.2</span> CGI context</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Install pg_format into your cgi-bin folder, grant execution on it as a CGI script (maybe you should add the .cgi extension) and get it from your favorite browser. Copy files logo_pgformatter.png and icon_pgformatter.ico in the CGI directory, pg_format.cgi look for them in the same repository.
</p>

<p>
将 pg_format 安装到 cgi-bin 文件夹，授予其作为 CGI 脚本的执行权（可能应该添加 <code>.cgi</code> 扩展名），并在浏览器中将其打开。 将文件 logo_pgformatter.png 和 icon_pgformatter.ico 复制到 CGI 目录中，pg_format.cgi 在同一个目录中查找它们。
</p>

<p>
You have a live example without limitation than ten thousand characters in your SQL query here: <a href="http://sqlformat.darold.net/">http://sqlformat.darold.net/</a>
</p>

<p>
这里有一个示例，可处理超过一万个字符的 SQL 查询：http：//sqlformat.darold.net/
</p>



<p>
pg_format will automatically detected that it is running in a CGI environment and will output all html code needed to run an online code formatter site. There's nothing more to do.
</p>

<p>
pg_format 能自动检测到它在 CGI 环境中运行，并将输出运行在线代码格式化程序站点所需的所有 html 代码。
</p>

<p>
You need to install Perl CGI module first if it is not already the case:
</p>

<p>
可能需要根据不同发行版安装 Perl CGI 模块：
</p>

<div class="org-src-container">
<pre class="src src-sh">yum install perl-cgi
</pre>
</div>
<p>
或者
</p>
<pre class="example">
apt-get install libcgi-pm-perl
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:31</p>
<p class="validation"></p>
</div>
</body>
</html>
